Repository: hongph713/QuanTracChatLuongKhongKhiHongPM
Catalog: lib/l10n/app_*.arb
Languages: vi

# appTitle
source: Air Quality Monitoring
vi: Quan Trắc Không Khí

# settingsTitle
source: Settings
vi: Cài đặt

# interfaceSectionTitle
source: Interface
vi: Giao diện

# languageSettingTitle
source: Language
vi: Ngôn ngữ

# englishLanguage
source: English
vi: Tiếng Anh

# vietnameseLanguage
source: Vietnamese
vi: Tiếng Việt

# themeSettingTitle
source: Theme
vi: Chủ đề

# lightTheme
source: Light
vi: Sáng

# darkTheme
source: Dark
vi: Tối

# systemTheme
source: System
vi: Theo hệ thống

# notificationsSectionTitle
source: Notifications
vi: Thông báo

# dailyNotificationsTitle
source: Daily notifications (7:00 AM)
vi: Thông báo hàng ngày

# noficationGeneralTitle
source: General Notifications
vi: Thông báo chung

# notificationsOn
source: On
vi: Đang bật

# notificationsOff
source: Off
vi: Đang tắt

# chooseLanguageModalTitle
source: Choose language
vi: Chọn ngôn ngữ

# chooseThemeModalTitle
source: Choose theme
vi: Chọn chủ đề

# mapTabLabel
source: Map
vi: Bản đồ

# stationListTabLabel
source: Station List
vi: Danh sách trạm đo

# settingsTabLabel
source: Settings
vi: Cài đặt

source: Station List
vi: Danh sách trạm đo

# aqiGood
source: Good
vi: Tốt

# aqiModerate
source: Moderate
vi: Trung bình

# aqiUnhealthyForSensitive
source: Unhealthy for Sensitive Groups
vi: Không lành mạnh cho nhóm nhạy cảm

# aqiUnhealthy
source: Unhealthy
vi: Không lành mạnh

# aqiVeryUnhealthy
source: Very Unhealthy
vi: Rất không lành mạnh

# aqiHazardous
source: Hazardous
vi: Nguy hiểm

# aqiGoodMessage
source: Air quality is good and safe for health
vi: Chất lượng không khí tốt, an toàn cho sức khỏe

# aqiModerateMessage
source: Air quality is at moderate level
vi: Chất lượng không khí ở mức trung bình

# aqiUnhealthyForSensitiveMessage
source: Sensitive groups may experience health problems
vi: Nhóm nhạy cảm có thể gặp vấn đề sức khỏe

# aqiUnhealthyMessage
source: Everyone may experience health problems
vi: Mọi người có thể gặp vấn đề sức khỏe

# aqiVeryUnhealthyMessage
source: Serious health warning
vi: Cảnh báo sức khỏe nghiêm trọng

# aqiHazardousMessage
source: Health emergency situation
vi: Tình trạng khẩn cấp về sức khỏe

# aqiMessageGood
source: Air quality is good!
vi: Chất lượng không khí tốt!

# aqiMessageModerate
source: Air quality is moderate. Sensitive groups should be cautious.
vi: Chất lượng không khí trung bình. Nhóm nhạy cảm nên cẩn thận!

# aqiMessageUnhealthyForSensitive
source: Unhealthy for sensitive groups. Limit outdoor activities!
vi: Không tốt cho nhóm nhạy cảm. Hạn chế hoạt động ngoài trời!

# aqiMessageUnhealthy
source: Harmful to health. Everyone should limit outdoor activities.
vi: Có hại cho sức khỏe. Mọi người nên hạn chế hoạt động ngoài trời!

# aqiMessageVeryUnhealthy
source: Very harmful to health. Everyone should stay indoors!
vi: Rất có hại cho sức khỏe. Mọi người nên ở trong nhà!

# aqiMessageHazardous
source: Hazardous. Everyone should stay indoors and turn on air purifiers!
vi: Nguy hiểm. Mọi người nên ở trong nhà và bật máy lọc không khí!

source: Main Pollutant: PM2.5
vi: Chất gây ô nhiễm chính: PM10

source: Temperature
vi: Nhiệt độ

source: Humidity
vi: Độ ẩm

# healthRecommendationsTitle
source: Health Recommendations
vi: Khuyến nghị về sức khoẻ

source: Health Recommendations
vi: Khuyến nghị sức khỏe

source: Enjoy outdoor activities
vi: Tận hưởng các hoạt động ngoài trời

# openWindowsForFreshAir
source: Open windows to bring clean and fresh air into the house
vi: Mở cửa sổ để đưa không khí sạch và trong lành vào nhà

# sensitiveGroupsReduceOutdoorExercise
source: Sensitive groups should reduce outdoor exercise
vi: Các nhóm nhạy cảm nên giảm tập thể dục ngoài trời

# closeWindowsToAvoidPollution
source: Close windows to avoid polluted air outside
vi: Đóng cửa sổ để tránh không khí bẩn bên ngoài

# sensitiveGroupsWearMask
source: Sensitive groups should wear masks when going outside
vi: Các nhóm nhạy cảm nên đeo khẩu trang khi ra ngoài

# sensitiveGroupsUseAirPurifier
source: Sensitive groups should turn on air purifiers
vi: Các nhóm nhạy cảm nên khởi động máy lọc không khí

source: Reduce outdoor exercise
vi: Giảm vận động ngoài trời

source: Run air purifier
vi: Chạy máy lọc không khí

source: Avoid outdoor exercise
vi: Tránh tập thể dục ngoài trời

source: Wear mask when outside
vi: Đeo khẩu trang khi ra ngoài

# healthRecommendationGoodOutdoor
source: Enjoy outdoor activities
vi: Tận hưởng các hoạt động ngoài trời

# healthRecommendationGoodWindows
source: Open windows to bring clean, fresh air into your home
vi: Mở cửa sổ để đưa không khí sạch và trong lành vào nhà

# healthRecommendationModerateOutdoor
source: Sensitive groups should reduce outdoor exercise
vi: Các nhóm nhạy cảm nên giảm tập thể dục ngoài trời

# healthRecommendationModerateWindows
source: Close windows to avoid polluted outdoor air
vi: Đóng cửa sổ để tránh không khí bẩn bên ngoài

# healthRecommendationModerateMask
source: Sensitive groups should wear masks when going outside
vi: Các nhóm nhạy cảm nên đeo khẩu trang khi ra ngoài

# healthRecommendationModerateAirPurifier
source: Sensitive groups should turn on air purifiers
vi: Các nhóm nhạy cảm nên khởi động máy lọc không khí

# healthRecommendationUnhealthySensitiveOutdoor
source: Reduce outdoor activities
vi: Giảm vận động ngoài trời

# healthRecommendationUnhealthySensitiveWindows
source: Close windows to avoid polluted outdoor air
vi: Đóng cửa sổ để tránh không khí bẩn bên ngoài

# healthRecommendationUnhealthySensitiveMask
source: Sensitive groups should wear masks when going outside
vi: Các nhóm nhạy cảm nên đeo khẩu trang khi ra ngoài

# healthRecommendationUnhealthySensitiveAirPurifier
source: Run air purifiers
vi: Chạy máy lọc không khí

# healthRecommendationUnhealthyOutdoor
source: Avoid outdoor exercise
vi: Tránh tập thể dục ngoài trời

# healthRecommendationUnhealthyWindows
source: Close windows to avoid polluted outdoor air
vi: Đóng cửa sổ để tránh không khí bẩn bên ngoài

# healthRecommendationUnhealthyMask
source: Wear masks when going outside
vi: Đeo khẩu trang khi ra ngoài

# healthRecommendationUnhealthyAirPurifier
source: Run air purifiers
vi: Chạy máy lọc không khí

# healthRecommendationVeryUnhealthyOutdoor
source: Avoid all outdoor activities
vi: Tránh mọi hoạt động ngoài trời

# healthRecommendationVeryUnhealthyWindows
source: Keep windows tightly closed. Stay indoors.
vi: Đóng kín cửa sổ. Ở trong nhà.

# healthRecommendationVeryUnhealthyMask
source: Must wear high-quality masks if going outside
vi: Bắt buộc đeo khẩu trang chất lượng cao nếu phải ra ngoài

# healthRecommendationVeryUnhealthyAirPurifier
source: Run air purifiers continuously
vi: Chạy máy lọc không khí liên tục

# healthRecommendationHazardousOutdoor
source: Absolutely avoid all outdoor activities. Stay indoors.
vi: Tránh tuyệt đối mọi hoạt động ngoài trời. Ở trong nhà.

# healthRecommendationHazardousWindows
source: Keep all windows tightly closed. Do not go outside unless necessary.
vi: Đóng kín tất cả cửa sổ. Không ra ngoài nếu không cần thiết.

# healthRecommendationHazardousMask
source: Must wear N95/FFP2 masks if going outside.
vi: Bắt buộc đeo khẩu trang N95/FFP2 nếu phải ra ngoài.

# healthRecommendationHazardousAirPurifier
source: Run air purifiers at highest setting.
vi: Chạy máy lọc không khí ở mức cao nhất.

# dataHistoryTitle
source: Data History
vi: Lịch sử dữ liệu

# noHistoricalData
source: No historical data available.
vi: Không có dữ liệu lịch sử.

# errorLoadingHistoryData
source: Error loading historical data.
vi: Lỗi tải dữ liệu lịch sử.

source: Last 24 hours
vi: 24 giờ qua

source: Last 7 days
vi: 7 ngày qua

# noDataForTimeRange
source: No data available for this time range.
vi: Không có dữ liệu

# noDataForPeriod
source: No data available for this period.
vi: Không có dữ liệu

source: Hour
vi: Giờ

source: Day
vi: Ngày

source: No data to display.
vi: Không có dữ liệu để hiển thị.

source: average
vi: trung bình

source: Loading data...
vi: Đang tải dữ liệu...

source: Loading map data...
vi: Đang tải dữ liệu bản đồ...

source: Error loading data.
vi: Lỗi tải dữ liệu.

# invalidDataFormat
source: Firebase data format is invalid.
vi: Dữ liệu Firebase không đúng định dạng.

source: Data processing error
vi: Lỗi xử lý dữ liệu

source: Firebase connection error
vi: Lỗi kết nối Firebase

source: Connecting to database...
vi: Đang kết nối đến cơ sở dữ liệu...

source: error
vi: lỗi

# noData
source: no
vi: không

# noDeviceData
source: No device data available.
vi: Không có dữ liệu thiết bị nào.

# noStationData
source: No station data available.
vi: Không có dữ liệu trạm nào.

# noStationFound
source: No stations found for
vi: Không tìm thấy trạm nào cho

source: No stations to display.
vi: Không có trạm nào để hiển thị.

# searchStationHint
source: Search by station name...
vi: Tìm kiếm theo tên trạm...

source: Search by station name...
vi: Tìm kiếm theo tên trạm...

source: Unknown location
vi: Vị trí không xác định

source: Location
vi: Vị trí

source: Address not found
vi: Không tìm thấy địa chỉ

# errorGettingLocation
source: Error getting location name from coordinates
vi: Lỗi khi lấy tên địa điểm từ tọa độ

# errorLocation
source: Error getting location
vi: Lỗi lấy vị trí

source: Cannot locate
vi: Không thể định vị

# unknownLocationDefaultCoords
source: Unknown location (default coordinates)
vi: Vị trí không xác định (tọa độ mặc định)

# locationWithCoords
source: Location ({lat}, {long})
vi: Vị trí ({lat}, {long})

# addressNotFoundWithCoords
source: Address not found ({lat}, {long})
vi: Không tìm thấy địa chỉ ({lat}, {long})

# errorGettingLocationFromCoords
source: Error getting location name from coordinates
vi: Lỗi khi lấy tên địa điểm từ tọa độ

# errorLocationWithCoords
source: Error getting location ({lat}, {long})
vi: Lỗi lấy vị trí ({lat}, {long})

# locationServiceDisabled
source: Location service is disabled
vi: Dịch vụ vị trí bị tắt

source: Location permission denied
vi: Quyền vị trí bị từ chối

source: Location permission denied forever
vi: Quyền vị trí bị từ chối vĩnh viễn

# locationPermissionDeniedForeverMessage
source: Location permission is permanently denied. Please open settings to grant permission.
vi: Quyền truy cập vị trí bị từ chối vĩnh viễn. Vui lòng mở cài đặt để cấp quyền.

# markedDevicesOnMap
source: Marked
vi: Đã đánh dấu

source: devices on map
vi: thiết bị trên bản đồ

# importantNotificationTitle
source: Important Notification
vi: Thông báo quan trọng

# notificationPermissionPrompt
source: Would you like to receive daily air quality notifications? (e.g., at 7:00 AM)
vi: Bạn có muốn nhận thông báo hàng ngày về chất lượng không khí không? (Ví dụ: lúc 7:00 sáng)

# noThanksButton
source: NO, THANKS
vi: KHÔNG, CẢM ƠN

# yesEnableButton
source: YES, ENABLE NOW
vi: CÓ, BẬT NGAY
